#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`[32m[1mSuccess![0m The configuration is valid.
[0m
`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.rg.azurerm_resource_group.resource_group[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "resource_group" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "westeurope"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-test"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {
          [32m+[0m [0m"environment" = "development"
          [32m+[0m [0m"owner"       = "john.doe@example.com"
        }
    }

[1m  # module.vnet.azurerm_virtual_network.vnet[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_virtual_network" "vnet" {
      [32m+[0m [0m[1m[0maddress_space[0m[0m         = [
          [32m+[0m [0m"10.0.0.0/16",
        ]
      [32m+[0m [0m[1m[0mdns_servers[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mguid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m              = "westeurope"
      [32m+[0m [0m[1m[0mname[0m[0m                  = "vnet-test"
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m   = "rg-test"
      [32m+[0m [0m[1m[0msubnet[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mvm_protection_enabled[0m[0m = false
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: ./tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "./tfplan.out"

```

</details>

*Pusher: @jovy07, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Pull Request`*